// From MacBuddy
// ---------------------------------------------------------------------
// * Buttons
// ---------------------------------------------------------------------
"OK_BUTTON"		= "OK";
"CANCEL_BUTTON"		= "Annulla";
"GOBACK_BUTTON"		= "Indietro";
"DIAGNOSE_BUTTON"	= "Esegui diagnosi";

// ---------------------------------------------------------------------
// * Progress message
// ---------------------------------------------------------------------
"MESSAGE_CONFIGURING"		= "Configuro il computer...";
"MESSAGE_PREP_CONNECTION"	= "Preparo la connessione...";

// ---------------------------------------------------------------------
// * Fatal error
// ---------------------------------------------------------------------
"FATAL_ERROR_PANEL_TITLE"		= "Errore inatteso";
"MESSAGE_FATAL_ERROR_TITLE"		= "Si è verificato un errore inatteso.";

// ---------------------------------------------------------------------
// * Generic error
// ---------------------------------------------------------------------
"GENERIC_ERROR_PANEL_TITLE"				= "Errore";
"ERROR_MESSAGE_GENERIC_TITLE"			= "Mi dispiace...";


// ---------------------------------------------------------------------
// * Data Validation
// ---------------------------------------------------------------------
"ERROR_MESSAGE_VALIDATION_FAILED_TITLE" = "Ci dispiace";
"ERROR_MESSAGE_VALIDATION_WARNING_TITLE" = "Avviso";
"ERROR_MESSAGE_VALIDATION_WARNING" = "Vuoi continuare?";

                    // Required field
"ERROR_MESSAGE_VALIDATION_0001_TITLE" = "Non hai specificato tutte le informazioni richieste.";
"ERROR_MESSAGE_VALIDATION_0001" = "Verifica i campi contrassegnati da una freccia rossa e inserisci le informazioni richieste.";

                    // Min-length field
"ERROR_MESSAGE_VALIDATION_0002_TITLE" = "Il testo inserito è troppo corto.";
"ERROR_MESSAGE_VALIDATION_0002" = "Verifica i campi evidenziati e correggi il testo inserito.";

                    // Matching fields (e.g. password)
"ERROR_MESSAGE_VALIDATION_0003" = "L'informazione inserita non è corretta.";

                    // NI Username invalid
"ERROR_MESSAGE_VALIDATION_0004_TITLE" = "Il nome utente inserito non è valido.";
"ERROR_MESSAGE_VALIDATION_0004" = "Verifica il campo evidenziato e inserisci un nome utente valido per il tuo network NetInfo.";

                    // NI Password invalid
"ERROR_MESSAGE_VALIDATION_0005_TITLE" = "La password inserita non è corretta.";
"ERROR_MESSAGE_VALIDATION_0005" = "Verifica il campo evidenziato e inserisci la password corretta.";

                    // UnixName invalid		-- refer to UsersPref
"ERROR_MESSAGE_VALIDATION_0006_TITLE" = "Il nome inserito non può essere utilizzato.";
"ERROR_MESSAGE_VALIDATION_0006" = "Verifica il campo evidenziato e scegli un nome breve diverso.";
"ERROR_MESSAGE_VALIDATION_0007" = "C'è già un utente con questo nome breve. Inserisci un nome breve diverso.";

                    // IPAddress invalid	-- refer to Open Transport
					// "ERROR_MESSAGE_VALIDATION_0008" - NSIPAddressIsValid
"ERROR_MESSAGE_VALIDATION_0009" = "L'indirizzo IP inserito è vuoto.";
"ERROR_MESSAGE_VALIDATION_0010" = "L'indirizzo IP che hai inserito contiene dei caratteri non validi.";
"ERROR_MESSAGE_VALIDATION_0011_TITLE" = "L'indirizzo deve comprendere 4 segmenti."; // too few segments
"ERROR_MESSAGE_VALIDATION_0011" = "Controlla il campo evidenziato ed inserisci un indirizzo valido. Se non conosci questa informazione chiedi al tuo amministratore di network.";
"ERROR_MESSAGE_VALIDATION_0012_TITLE" = "L'indirizzo deve comprendere 4 segmenti."; // too many segments
"ERROR_MESSAGE_VALIDATION_0012" = "Controlla il campo evidenziato ed inserisci un indirizzo valido. Se non conosci questa informazione chiedi al tuo amministratore di network.";
"ERROR_MESSAGE_VALIDATION_0013_TITLE" = "Ogni segmento dell'indirizzo deve contenere da 1 a 3 caratteri."; // no segments
"ERROR_MESSAGE_VALIDATION_0013" = "Controlla il campo evidenziato ed inserisci un indirizzo valido. Se non conosci questa informazione chiedi al tuo amministratore di network.";
"ERROR_MESSAGE_VALIDATION_0014_TITLE" = "L'indirizzo inserito non è valido.";
"ERROR_MESSAGE_VALIDATION_0014" = "Controlla il campo evidenziato ed inserisci un indirizzo valido. Se non conosci questa informazione chiedi al tuo amministratore di network.";

                    // SubnetMask invalid
"ERROR_MESSAGE_VALIDATION_0015_TITLE" = "La maschera di sottorete inserita non è valida.";
"ERROR_MESSAGE_VALIDATION_0015" = "Controlla il campo evidenziato ed inserisci un indirizzo valido. Se non conosci questa informazione chiedi all’amministratore di network.";

                    // notNIUsername
"ERROR_MESSAGE_VALIDATION_0016" = "Il nome inserito è già nel network NetInfo e non potrai usarlo per accedere a NetInfo.";

                    // Unique fields
"ERROR_MESSAGE_VALIDATION_0017" = "Non puoi inserire lo stesso valore.";

                    // Wireless Network password
"ERROR_MESSAGE_VALIDATION_0018" = "La password inserita non è valida.";

"ERROR_MESSAGE_VALIDATION_0019_TITLE" = "Il numero di carta di credito inserito non può essere utilizzato.";
"ERROR_MESSAGE_VALIDATION_0019" = "Verifica il campo evidenziato e inserisci un numero di carta di credito valido.";

                    // Account name
"ERROR_MESSAGE_VALIDATION_0020" = "Il tuo nome di account non può iniziare con un numero.";

                    // EMail address
"ERROR_MESSAGE_VALIDATION_0021" = "Verifica che l'indirizzo e-mail inserito sia corretto.";

                    // SubnetMask & IPAddress, Router consistency check
"ERROR_MESSAGE_VALIDATION_0022" = "L’indirizzo IP e quello del router non sono compatibili con la maschera di sottorete. Controlla i seguenti campi ed inserisci dei valori corretti:\n Indirizzo IP\n Maschera di Sottorete\n Indirizzo di Router\nSe non conosci questa informazione chiedi all’amministratore di network.";

                    // Wrong long username
"ERROR_MESSAGE_VALIDATION_0023_TITLE" = "Il nome inserito non può essere utilizzato.";
"ERROR_MESSAGE_VALIDATION_0023" = "Controlla il campo evidenziato e scegli un nome diverso.";

                    // Unique Array
"ERROR_MESSAGE_VALIDATION_0024_TITLE" = "Ci sono valori ripetuti.";
"ERROR_MESSAGE_VALIDATION_0024" = "Controlla il campo evidenziato ed inserisci un unico valore.";

// ---------------------------------------------------------------------
// * System Configuration
// ---------------------------------------------------------------------
"MESSAGE_NO_DIAL_TONE_TITLE"			= "Il modem non rileva alcun tono di chiamata.";
"MESSAGE_NO_DIAL_TONE"					= "Verifica che il modem sia collegato e fai clic su OK, oppure su Annulla per tornare indietro e selezionare l'opzione Ignora tono di chiamata.";

// ========== Network Setup Assistant addition ==========
"QUIT_BUTTON"		= "Esci";
                                        // Field specific errors
"ERROR_PASSWORD_DO_NOT_MATCH_TITLE" = "Le password non coincidono.";
"ERROR_PASSWORD_DO_NOT_MATCH" = "Verifica i campi contrassegnati da frecce rosse e inserisci la stessa password in entrambi i campi.";

"ERROR_MUST_ENTER_LOCATION_NAME_TITLE" = "Inserisci un nome per la posizione.";
"ERROR_MUST_ENTER_LOCATION_NAME" = "Stai creando una posizione di network in cui verrà registrata informazione di configurazione. Inserisci un nome per la posizione.";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME_TITLE" = "Inserisci un nome diverso per la  posizione.";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME" = "Il nome della posizione indicato esiste già. Scegli un nome diverso.";


"MESSAGE_TASK_FORMAT" = "“%1$@ connessione via %2$@”"; // %1$@ = CONNECTION, %2$@ = CONFIGURATION
"CONNECTION_Wireless" = "Wireless";
"CONNECTION_Modem" = "Modem";
"CONNECTION_DSL" = "DSL";
"CONNECTION_CableModem" = "Modem via Cavo";
"CONNECTION_Lan" = "Network Area Locale";
"CONFIGURE_PPP" = "PPP";
"CONFIGURE_DHCP" = "DHCP";
"CONFIGURE_DHCPClientID" = "DHCP con ID Cliente";
"CONFIGURE_PPPoE" = "PPPoE";
"CONFIGURE_Manual" = "Indirizzo IP Statico";

"MESSAGE_TITLE_CONFIGURE" = "Configurazione in corso...";
"MESSAGE_FAILED_CONFIGURE" = "Configurazione fallita.";
"MESSAGE_DONE_CONFIGURE" = "Termina configurazione.";
"MESSAGE_CHECKING_CONNECTION" = "Controllo della connessione di network in corso ...";
"MESSAGE_CONNECTED" = "Connessione di network effettuata.";
"MESSAGE_NOT_CONNECTED" = "Impossibile effettuare una connessione di network.";
"MESSAGE_NOT_CONNECTED_TRY_AGAIN" = "Il computer non si è connesso a Internet. Fai clic su OK per retrocedere e cambiare le impostazioni del network, poi ritenta.";

"DEFAULT_LOCATION_NAME" = "Posizione (%@)";
"DUPLICATE_LOCATION_NAME" = "%1$@ %2$d";